[
  {
    "name": "Panida Theater",
    "slug": "panida-theater",
    "address": "300 N First Ave, Sandpoint, ID 83864",
    "imageUrl": "/images/venueimages/panidalogo.png",
    "overview": "The Panida theater opened as a vaudeville and movie house in 1927. Then, as now, its name reflected its mission: to showcase great performers and performances for audiences of the PANhandle of IDAho. Featuring local and global film festivals, movies and presentations, local dance recitals and professional dance performances, comedy, live theatre, educational and informative speakers and presentations, local and touring artists for music concerts, and more."
  },
  {
    "name": "Travers Park",
    "slug": "travers-park",
    "address": "2102 Pine St, Sandpoint, ID 83864",
    "imageUrl": "/images/venueimages/traverspark.png",
    "overview": "Travers Park, located on Pine Street, boasts nearly 18 acres. Travers was developed with funding assistance from the Land and Water Conservation Fund and was opened for play in 1986. The original 5 acres was the site o the old city dump, with 10 additional acres acquired through a land trade acquisition with the Louisiana Pacific Corporation. The remaining 2.5 acres were purchased from a private party. The park was named for Frank Travers, who was the commissioner of baseball at Memorial Field for many years in Sandpoint, which included grounds keeping and maintenance duties. Frank was also a farmer and raised nine children, so baseball was often a break from these challenges. The parks serves as Sandpoint's major sports complex for youth and adults. It has a wide variety of amenities listed above."
  },
  {
    "name": "Bonner County Fairgrounds",
    "slug": "bonner-county-fairgrounds",
    "address": "4203 N Boyer Ave, Sandpoint, ID 83864",
    "imageUrl": "/images/venueimages/fairgrounds.jpg",
    "overview": "The Bonner County Fairgrounds is located in Sandpoint, Idaho. Sandpoint is located in the panhandle of North Idaho on the northern shores of Lake Pend Oreille and at the foot of the Selkirk Mountains. The Bonner County Fairgrounds is north of beautiful Sandpoint and nestled near the base of the mountains, creating an ambiance of scenic beauty. There is always something going on at the Bonner County Fairgrounds. The fairgrounds may be the place for your event whether you are planning a company party, wedding, a fundraiser, trade show, horse show or even a meeting. The Bonner County Fairgrounds is the place for you! Our Main Exhibit building is ideal for trade shows, banquets, and reunions; we have ample room for exhibits and patrons alike. Other buildings and grounds can be rented based on the needs of the event. We can provide tables and chairs, bleachers, stages and we have ample parking."
  },
  {
    "name": "Healing Garden",
    "slug": "healing-garden",
    "address": "520 N Third Ave, Sandpoint, ID 83864",
    "imageUrl": "/images/venueimages/healinggarden.jpeg",
    "overview": "The Healing Garden is a place of spiritual solace. It was designed as a tranquil retreat for those facing difficult times, as well as a place of peace in which to honor and remember loved ones we have lost. The garden was built on the grounds of Bonner General Health and was designed by an enthusiastic group of community and hospital volunteers. Stroll the grounds of the garden and surround yourself with the beauty of nature. Young or old, solemn or joyous, in sickness or in health, the Healing Garden will wrap its arms around you. Garden paths curve and wind between carefully chosen flowers, shrubs, and trees, some planted in memory of loved ones. The carved eagle that perches atop the waterfall was discovered off the dock area. As part of the original grounds, he makes a fitting garden guardian. The leaves imprinted on the pathways resemble fossils and remind us of the full cycle of nature. Even before it was built, the Healing Garden brought our community together. Allied with a common goal, residents, and volunteers worked to create a place of healing that truly reflects the surrounding natural beauty that we enjoy here in northern Idaho. In every way, in every season, the Healing Garden achieves this purpose. The Healing Garden is 100% funded and maintained by donations and volunteers.  If you would like to make a donation please fill out the form below."
  },
  {
    "name": "Long Bridge",
    "slug": "long-bridge",
    "address": "U.S. Highway 95 over Lake Pend Oreille, Sandpoint, ID",
    "imageUrl": "/images/venueimages/longbridge.png",
    "overview": "On 26 May 1908 the first pilings for the first bridge connecting Sagle, Idaho with Sandpoint, Idaho were driven. When completed the bridge was supported by 1,540 pilings and covered a distance of almost two miles. Near the center was a steel lift which allowed the steam boat traffic to pass underneath. After numerous problems the bridge was completed and ready for use on March 11, 1910 and was advertised as the longest wooden bridge in the world. When completed the bridge was about 200 feet short of two miles long. It served the area for many years until in the 1930's it was torn down to make room for a new wooden bridge. It was during the great depression that the second bridge over the Pend Oreille River was constructed. It was built with help from the WPA (Works Progress Administration) and was dedicated on March 3, 1934. The bridge retained the name of 'The longest wooden bridge in the world' and for many years tourists, hunters, fishermen, and people who came to the area just to see the bridge used it. Unlike the first bridge, whose planks were placed long-ways, the second bridge was quieter and safer. The second bridge served the area for about 22 years. The heavy traffic of World War II took its toll on the structure and in June of 1956 the third bridge was built. It could no longer be called 'The longest wooden bridge' in the world' because it was built of steel and concrete. The span is also partly fill and partly bridge."
  },
  {
    "name": "Smokesmith BBQ",
    "slug": "smokesmith-bbq",
    "address": "102 S Boyer Ave, Sandpoint, ID 83864",
    "imageUrl": "/images/venueimages/smokesmith.jpg",
    "overview": "Smokesmith Bar-B-Que, serving North Idaho and beyond! We lit our first smoker in 2019 to turn a backyard hobby—and an excuse for more brisket—into a craft barbecue obsession. Today, in beautiful Sandpoint, we serve bold Texas‑style favorites from melt‑in‑your‑mouth brisket to high‑five‑worthy ribs—that’ll keep you coming back for more. Join us for good food, good friends, and great times, every day."
  },
  {
    "name": "Farmin Park",
    "slug": "farmin-park",
    "address": "Third Ave & Main St, Sandpoint, ID 83864",
    "imageUrl": "/images/venueimages/farminpark.jpg",
    "overview": "In the heart of downtown Sandpoint, Farmin Park  is a ½ acre parcel that was donated to the City by the Farmin family.  The Hawkins family (Litehouse) donated the bandstand and improvements, including sidewalks, pathways, and a clock tower was provided by the Sandpoint Rotary Club. This park is the location for the seasonal Farmer’s Market in Sandpoint, and local musicians and special events reserve the bandstand throughout the summer months.  Many people use the park for a relaxing lunch break, or just a place to stop and sit for a while."
  },
  {
    "name": "Sandpoint Library",
    "slug": "sandpoint-library",
    "address": "1407 Cedar St, Sandpoint, ID 83864",
    "imageUrl": "/images/venueimages/library.jpg",
    "overview": "The East Bonner County Library District was originally the Sandpoint Public Library. It was located upstairs in the City Hall building on Main and Second. In December of 1967, a chain of high school students from the Class of ’68 moved the books from City Hall to the building at 419 North Second Avenue where MickDuff’s Brewing Company is currently located. In 1974, the East Bonner County Library District was formed after a vote of the county residents. The district boundaries are shared by the Pend Oreille Hospital District, encompassing the eastern portion of Bonner County from approximately just east of Priest River and extending to the Montana border. By the late 1980’s, the library district had outgrown its Sandpoint facility. In May of 1998, the patrons passed a bond that would build new facilities in Sandpoint and Clark Fork as well as purchase a Bookmobile. The current facility in Sandpoint, on the corner of Cedar and Division, more than tripled the space of the previous building, and an expansion in 2017 added another 7000 square feet."
  },
  {
    "name": "Eichardt's Pub",
    "slug": "eichardts-pub",
    "address": "212 Cedar St, Sandpoint, ID 83864",
    "imageUrl": "/images/venueimages/eichardts.png",
    "overview": "Casual dining, Seriously good food. Beer."
  },
  {
    "name": "Music Conservatory of Sandpoint",
    "slug": "music-conservatory",
    "address": "110 Main St, Sandpoint, ID 83864",
    "imageUrl": "/images/venueimages/musicconservatory.jpg",
    "overview": "MCS, an international school of performing arts, offers accredited programming within a classical framework. Our staff is dedicated to educate and inspire students of all ages from all different backgrounds on their journey from beginning student to master performer. A nurturing environment is important to us! MCS focuses on collaboration, exposure to other cultures and excellence in the performing arts.  Our school owns a historic building which is part of a creative placemaking project to house the creative minds of the future."
  }
]